In [56]:
import pandas as pd
import numpy as np
import mysql.connector

In [5]:
# read the csv file
df=pd.read_csv("final_details_to_csv.csv")
df

,Bus_name,Bus_type,Start_time,End_time,Total_duration,Price,Seats_Available,Ratings,Route_link,Route_name,State
0,APSARA BUS SERVICE,Non AC Seater (2+2),08:40,13:15,04h 35m,INR 500,26 Seats available,New,https://www.redbus.in/bus-tickets/gangtok-to-s...,Gangtok to Siliguri,Sikkim
1,APSARA BUS SERVICE,Non AC Seater (2+2),09:00,12:55,03h 55m,INR 500,28 Seats available,New,https://www.redbus.in/bus-tickets/gangtok-to-s...,Gangtok to Siliguri,Sikkim
2,APSARA BUS SERVICE,Non AC Seater (2+2),10:50,15:20,04h 30m,INR 500,28 Seats available,1.4\n4,https://www.redbus.in/bus-tickets/gangtok-to-s...,Gangtok to Siliguri,Sikkim
3,APSARA BUS SERVICE,Non AC Seater (2+2),12:30,17:00,04h 30m,INR 500,27 Seats available,New,https://www.redbus.in/bus-tickets/gangtok-to-s...,Gangtok to Siliguri,Sikkim
4,APSARA BUS SERVICE,Non AC Seater (2+2),14:00,18:35,04h 35m,INR 500,28 Seats available,New,https://www.redbus.in/bus-tickets/gangtok-to-s...,Gangtok to Siliguri,Sikkim
...,...,...,...,...,...,...,...,...,...,...,...
5363,Meghalaya Transport Corporation(MTC) - 163370,Tata Non A/C Seater Executive Luxury (2+2),17:00,04:00,11h 00m,INR 581,14 Seats available,3.0\n62,https://www.redbus.in/bus-tickets/williamnagar...,Williamnagar (Meghalaya) to Shillong,Megalaya
5364,Meghalaya Transport Corporation(MTC) - 163369,Tata Non A/C Seater Executive Luxury (2+2),19:15,04:30,09h 15m,INR 384,28 Seats available,3.7\n40,https://www.redbus.in/bus-tickets/shillong-to-...,Shillong to Hailakandi,Megalaya
5365,AR Travels,Non AC Seater (2+2),21:20,05:50,08h 30m,INR 550,40 Seats available,1.7,https://www.redbus.in/bus-tickets/shillong-to-...,Shillong to Hailakandi,Megalaya
5366,Meghalaya Transport Corporation(MTC) - 163369,Tata Non A/C Seater Executive Luxury (2+2),19:15,05:30,10h 15m,INR 425,32 Seats available,3.5\n34,https://www.redbus.in/bus-tickets/shillong-to-...,Shillong to Ramkrishnanagar,Megalaya
5367,AR Travels,Non AC Seater (2+2),17:30,04:30,11h 00m,450,34 Seats available,1.7,https://www.redbus.in/bus-tickets/hailakandi-t...,Hailakandi to Shillong,Megalaya

In [25]:
#Check is any null value available
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5368 entries, 0 to 5367
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Bus_name         5368 non-null   object
 1   Bus_type         5368 non-null   object
 2   Start_time       5368 non-null   object
 3   End_time         5368 non-null   object
 4   Total_duration   5368 non-null   object
 5   Price            5368 non-null   object
 6   Seats_Available  5368 non-null   object
 7   Ratings          5368 non-null   object
 8   Route_link       5368 non-null   object
 9   Route_name       5368 non-null   object
 10  State            5368 non-null   object
dtypes: object(11)
memory usage: 461.4+ KB

In [27]:
#Check number of duplicate row
df.duplicated().sum()

3

In [29]:
#convert prices to numeric
df["Price"]=df["Price"].str.replace("INR","")
df["Price"]=df["Price"].astype(float)
df["Price"].fillna(0)

0       500.0
1       500.0
2       500.0
3       500.0
4       500.0
        ...
5363    581.0
5364    384.0
5365    550.0
5366    425.0
5367    450.0
Name: Price, Length: 5368, dtype: float64

In [37]:
#convert Ratings to numeric
df["Ratings"]=df["Ratings"].str.replace("New","")
df["Ratings"]=df["Ratings"].str.strip()
df["Ratings"]=df["Ratings"].str.split().str[0]
df["Ratings"] = pd.to_numeric(df["Ratings"], errors='coerce')
#df["Ratings"].fillna(0,inplace=True) 
df.fillna({"Ratings": 0}, inplace=True)

In [39]:
df["Ratings"]

0       0.0
1       0.0
2       1.4
3       0.0
4       0.0
       ...
5363    3.0
5364    3.7
5365    1.7
5366    3.5
5367    1.7
Name: Ratings, Length: 5368, dtype: float64

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5368 entries, 0 to 5367
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Bus_name         5368 non-null   object
 1   Bus_type         5368 non-null   object
 2   Start_time       5368 non-null   object
 3   End_time         5368 non-null   object
 4   Total_duration   5368 non-null   object
 5   Price            5368 non-null   float64
 6   Seats_Available  5368 non-null   object
 7   Ratings          5368 non-null   float64
 8   Route_link       5368 non-null   object
 9   Route_name       5368 non-null   object
 10  State            5368 non-null   object
dtypes: float64(2), object(9)
memory usage: 461.4+ KB

In [47]:
# replacing the nan value
df = df.replace({np.nan: None})

In [52]:
# Convert dataframe to CSV
path=r"final_busdetails.csv"
df.to_csv(path,index=False)

### Create Mysql Database and store data

In [78]:
conn=mysql.connector.connect(host="localhost", user="root", password="Rn@9867908494")
my_cursor = conn.cursor()
my_cursor.execute("CREATE DATABASE IF NOT EXISTS RED_Final_BUS_DETAILS")

In [80]:
my_cursor.execute("USE RED_Final_BUS_DETAILS")

In [82]:
# Table Creation
my_cursor.execute('''CREATE TABLE IF NOT EXISTS bus_details(
                  ID INT AUTO_INCREMENT PRIMARY KEY,
                  Bus_name VARCHAR(255) NOT NULL,
                  Bus_type VARCHAR(255) NOT NULL,
                  Start_time VARCHAR(255) NOT NULL,
                  End_time VARCHAR(255) NOT NULL,
                  Total_duration VARCHAR(255) NOT NULL,
                  Price FLOAT NULL,
                  Seats_Available VARCHAR(255) NOT NULL,
                  Ratings Float NULL,
                  Route_link VARCHAR(255) NULL,
                  Route_name VARCHAR(255) NULL,
                  State VARCHAR(255) NULL
                  )''')
print("Table Created successfully")

Table Created successfully

In [84]:
# SQL query to insert data into bus_details table
insert_query = '''INSERT INTO bus_details(
                    Bus_name,
                    Bus_type,
                    Start_time,
                    End_time,
                    Total_duration,
                    Price,
                    Seats_Available,
                    Ratings,
                    Route_link,
                    Route_name,
                    State)
                  VALUES(%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)'''
data = df.values.tolist()

my_cursor.executemany(insert_query, data)

conn.commit()

print("Values inserted successfully")

Values inserted successfully